interface TypeJobAndMater {
    [index: string]: number;
}
interface TypeMyObject {
    [index: string]: TypeInObject[]
}
export interface TypeInObject {
    [index: string]: TypeJobAndMater
}
export interface typeListApartment {
    [index:string]: string;
}

export const selects: typeListApartment = {
    'Новостройка': 'newApartment',
    'Квартира': 'apartment',
    'Комната': 'room',
    'Санузел': 'bathroom',
    'Кухня': 'kitchen',
}

const jobCost: TypeJobAndMater = {
    'Демонтаж штукатурки' : 160, // 0
    'Демонтаж напольного покрытия': 120, // 1
    'Демонтаж деверянных конструкций': 3000, // 2
    'Демонтаж перегородок': 600, // 3
    'Демонтаж плитки': 300, // 4
    'Демонтаж стяжки': 500, // 5
    'Затаривание в мешки': 500, // 6
    'Вынос мусора': 500, // 7
    'Вывоз мусора': 1800, // 8
    'Грунтование': 50, // 9
    'Штукатурка стен': 250, // 10
    'Шпатлевка стен': 200, // 11
    'Наливной пол': 400, // 12
    'Монтаж стяжки': 600, // 13
    'Прокладка штробы': 500, // 14
    'Прокладка кабеля': 50, // 15
    'Монтаж разпредкоробок': 50, // 16
    'Отверстие под розетку': 200, // 17
    'Монтаж разпредшкафа': 6000, // 18
    'Покраска стен': 200, // 19
    'Поклейка обоев': 150, // 20
    'Пайка медных труб': 6000, // 21
    'Поклейка плитки': 600, // 22
    'Монтаж ванны': 3000, // 23
    'Монтаж унитаза': 2500, // 24
    'Монтаж раковины': 2500, // 25
    'Монтаж натяжного потолка': 300, // 26
    'Монтаж точек': 200, // 27
    'Монтаж закладной': 500, // 28
    'Нанесение разметки': 200,
    'Возведение перегородок': 500,
}
const materialsWaste: TypeJobAndMater = {
    // расход на 1 м.кв.
    'Грунтовка': 0.1, // litr
    'Мешки под мусор': 30, // kg
    'Штукатурка': 1.4, // kg
    'Шпатлевка': 4, // kg
    'Медь': 1,
    'Наливной пол': 1.6, // kg
    'Грубый ровнитель': 15, // kg
    'Краска': 0.2,
    'Обои': 0.1
}
const materialsCost: TypeJobAndMater = {
    // стоимость расхода на 1 м.кв
    'Грунтовка': 7,
    'Мешки под мусор': 15,
    'Штукатурка': 18,
    'Шпатлевка': 120,
    'Медь': 7000,
    'Наливной пол': 32,
    'Грубый ровнитель': 100,
    'Краска': 40,
    'Обои': 150
}

export const objects = ( eventInput: number, nameApartment: string ):TypeInObject[] => {
    const nameObjects: TypeMyObject = {
        'newApartment': [{
            'Возведение перегородок': {
                'Нанесение разметки': (eventInput * jobCost['Нанесение разметки']),
                ' Возведение перегородок': (eventInput * jobCost['Возведение перегородок'])
            },
            'Электротехнические работы': {
                'Прокладка штробы': ((eventInput / 2) * jobCost['Прокладка штробы']),
                'Прокладка кабеля': (eventInput * jobCost['Прокладка кабеля']),
                'Монтаж разпредкоробок': (12 * jobCost['Монтаж разпредкоробок']),
                'Отверстие под розетку': (35 * jobCost['Отверстие под розетку']),
                'Монтаж разпредшкафа': (jobCost['Монтаж разпредшкафа'])
            },
            'Штукатурные работы': {
                'Грунтование': ((eventInput * 2.5) * jobCost['Грунтование']),
                'Штукатурка стен': ((eventInput * 2.5) * jobCost['Штукатурка стен']),
                'Шпатлевка стен': ((eventInput * 2.5) * jobCost['Шпатлевка стен'])
            },
            'Сантехнические работы': {
                'Пайка медных труб': (jobCost['Пайка медных труб']),
                'Поклейка плитки': (20 * jobCost['Поклейка плитки']),
                'Монтаж ванны': (jobCost['Монтаж ванны']),
                'Монтаж унитаза': (jobCost['Монтаж унитаза']),
                'Монтаж раковины': (jobCost['Монтаж раковины'])
            },
            'Монтаж натяжного потолка': {
                'Монтаж натяжного потолка': (eventInput * jobCost['Монтаж натяжного потолка']),
                'Монтаж точек': (eventInput * jobCost['Монтаж точек']),
                'Монтаж закладной': (jobCost['Монтаж закладной'])
            },
            'Работы с полом': {
                'Грунтование': (eventInput * jobCost['Грунтование']),
                'Наливной пол': (eventInput * jobCost['Наливной пол'])
            }
        }, {
            'материалЦена': {
                'Шпатлевка': ((eventInput * 2.5) * (materialsCost['Шпатлевка'])),
                'Штукатурка': ((eventInput * 2.5) * (materialsCost['Штукатурка'])),
                'Наливной пол': ((eventInput) * (materialsCost['Наливной пол'])),
                'Медь': (materialsCost['Медь']),
                'Мешки под мусор': (materialsWaste['Мешки под мусор']) * (materialsCost['Мешки под мусор']),
                'Грунтовка': ((eventInput * 2.5) * materialsCost['Грунтовка']) * 2
            },
        }, {
            'материалРасход': {
                'Шпатлевка': ((eventInput * 2.5) * (materialsWaste['Шпатлевка'])),
                'Штукатурка': Math.round((eventInput * 2.5) * (materialsWaste['Штукатурка'])),
                'Наливной пол': Math.round((eventInput) * (materialsWaste['Наливной пол'])),
                'Медь': materialsWaste['Медь'],
                'Мешки под мусор': materialsWaste['Мешки под мусор'],
                'Грунтовка': ((eventInput * 2.5) * (materialsWaste['Грунтовка'])) * 2
            },
        }],
        'apartment': [{
            'Демонтажные работы': {
                'Демонтаж штукатурки': ((eventInput * 2.5) * jobCost['Демонтаж штукатурки']),
                'Демонтаж напольного покрытия': (eventInput * jobCost['Демонтаж напольного покрытия']),
                'Демонтаж деверянных конструкций': (jobCost['Демонтаж деверянных конструкций']),
                'Демонтаж плитки': (12.5 * jobCost['Демонтаж плитки']),
                'Затаривание в мешки': jobCost['Затаривание в мешки'],
                'Вынос мусора': jobCost['Вынос мусора'],
                'Вывоз мусора': jobCost['Вывоз мусора']
            },
            'Электротехнические работы': {
                'Прокладка штробы': ((eventInput / 2) * jobCost['Прокладка штробы']),
                'Прокладка кабеля': (eventInput * jobCost['Прокладка кабеля']),
                'Монтаж разпредкоробок': (12 * jobCost['Монтаж разпредкоробок']),
                'Отверстие под розетку': (35 * jobCost['Отверстие под розетку']),
                'Монтаж разпредшкафа': (jobCost['Монтаж разпредшкафа'])
            },
            'Штукатурные работы': {
                'Грунтование': ((eventInput * 2.5) * jobCost['Грунтование']),
                'Штукатурка стен': ((eventInput * 2.5) * jobCost['Штукатурка стен']),
                'Шпатлевка стен': ((eventInput * 2.5) * jobCost['Шпатлевка стен'])
            },
            'Сантехнические работы': {
                'Пайка медных труб': (jobCost['Пайка медных труб']),
                'Поклейка плитки': (20 * jobCost['Поклейка плитки']),
                'Монтаж ванны': (jobCost['Монтаж ванны']),
                'Монтаж унитаза': (jobCost['Монтаж унитаза']),
                'Монтаж раковины': (jobCost['Монтаж раковины'])
            },
            'Монтаж натяжного потолка': {
                'Монтаж натяжного потолка': (eventInput * jobCost['Монтаж натяжного потолка']),
                'Монтаж точек': (eventInput * jobCost['Монтаж точек']),
                'Монтаж закладной': (jobCost['Монтаж закладной'])
            },
            'Работы с полом': {
                'Грунтование': (eventInput * jobCost['Грунтование']),
                'Наливной пол': (eventInput * jobCost['Наливной пол'])
            }
        }, {
            'материалЦена': {
                'Шпатлевка': ((eventInput * 2.5) * (materialsCost['Шпатлевка'])),
                'Штукатурка': ((eventInput * 2.5) * (materialsCost['Штукатурка'])),
                'Наливной пол': ((eventInput) * (materialsCost['Наливной пол'])),
                'Медь': (materialsCost['Медь']),
                'Мешки под мусор': (materialsWaste['Мешки под мусор']) * (materialsCost['Мешки под мусор']),
                'Грунтовка': ((eventInput * 2.5) * materialsCost['Грунтовка']) * 2
            },
        }, {
            'материалРасход': {
                'Шпатлевка': ((eventInput * 2.5) * (materialsWaste['Шпатлевка'])),
                'Штукатурка': Math.round((eventInput * 2.5) * (materialsWaste['Штукатурка'])),
                'Наливной пол': Math.round((eventInput) * (materialsWaste['Наливной пол'])),
                'Медь': materialsWaste['Медь'],
                'Мешки под мусор': materialsWaste['Мешки под мусор'],
                'Грунтовка': ((eventInput * 2.5) * (materialsWaste['Грунтовка'])) * 2
            },

        }],
        'room': [{
            'Демонтажные работы': {
                'Демонтаж штукатурки': ((eventInput * 2.5) * jobCost['Демонтаж штукатурки']),
                'Демонтаж напольного покрытия': (eventInput * jobCost['Демонтаж напольного покрытия']),
                'Затаривание в мешки': jobCost['Затаривание в мешки'],
                'Вынос мусора': jobCost['Вынос мусора'],
                'Вывоз мусора': jobCost['Вывоз мусора']
            },
            'Электротехнические работы': {
                'Прокладка штробы': ((eventInput / 2) * jobCost['Прокладка штробы']),
                'Прокладка кабеля': (eventInput * jobCost['Прокладка кабеля']),
                'Монтаж разпредкоробок': (2 * jobCost['Монтаж разпредкоробок']),
                'Отверстие под розетку': (6 * jobCost['Отверстие под розетку']),
            },
            'Штукатурные работы': {
                'Грунтование': ((eventInput * 2.5) * jobCost['Грунтование']),
                'Штукатурка стен': ((eventInput * 2.5) * jobCost['Штукатурка стен']),
                'Шпатлевка стен': ((eventInput * 2.5) * jobCost['Шпатлевка стен'])
            },
            'Монтаж натяжного потолка': {
                'Монтаж натяжного потолка': (eventInput * jobCost['Монтаж натяжного потолка']),
                'Монтаж точек': (eventInput * jobCost['Монтаж точек']),
                'Монтаж закладной': (jobCost['Монтаж закладной'])
            },
            'Работы с полом': {
                'Грунтование': (eventInput * jobCost['Грунтование']),
                'Наливной пол': (eventInput * jobCost['Наливной пол'])
            }
        }, {
            'материалЦена': {
                'Шпатлевка': ((eventInput * 2.5) * (materialsCost['Шпатлевка'])),
                'Штукатурка': ((eventInput * 2.5) * (materialsCost['Штукатурка'])),
                'Наливной пол': ((eventInput) * (materialsCost['Наливной пол'])),
                'Мешки под мусор': (materialsWaste['Мешки под мусор']) * (materialsCost['Мешки под мусор']),
                'Грунтовка': ((eventInput * 2.5) * materialsCost['Грунтовка']) * 2
            },
        }, {
            'материалРасход': {
                'Шпатлевка': ((eventInput * 2.5) * (materialsWaste['Шпатлевка'])),
                'Штукатурка': Math.round((eventInput * 2.5) * (materialsWaste['Штукатурка'])),
                'Наливной пол': Math.round((eventInput) * (materialsWaste['Наливной пол'])),
                'Мешки под мусор': materialsWaste['Мешки под мусор'],
                'Грунтовка': ((eventInput * 2.5) * (materialsWaste['Грунтовка'])) * 2
            },

        }],
        'bathroom': [{
            'Демонтажные работы': {
                'Демонтаж плитки': (((eventInput * 2.5) + eventInput) * jobCost['Демонтаж плитки']),
                'Затаривание в мешки': jobCost['Затаривание в мешки'],
                'Вынос мусора': jobCost['Вынос мусора'],
                'Вывоз мусора': jobCost['Вывоз мусора']
            },
            'Электротехнические работы': {
                'Прокладка штробы': ((eventInput / 2) * jobCost['Прокладка штробы']),
                'Прокладка кабеля': (eventInput * jobCost['Прокладка кабеля']),
                'Отверстие под розетку': (2 * jobCost['Отверстие под розетку']),
            },
            'Штукатурные работы': {
                'Грунтование': ((eventInput * 2.5) * jobCost['Грунтование']),
                'Штукатурка стен': ((eventInput * 2.5) * jobCost['Штукатурка стен']),
            },
            'Сантехнические работы': {
                'Пайка медных труб': (jobCost['Пайка медных труб']),
                'Поклейка плитки': (((eventInput * 2.5) + eventInput) * jobCost['Поклейка плитки']),
                'Монтаж ванны': (jobCost['Монтаж ванны']),
                'Монтаж унитаза': (jobCost['Монтаж унитаза']),
                'Монтаж раковины': (jobCost['Монтаж раковины'])
            },
            'Монтаж натяжного потолка': {
                'Монтаж натяжного потолка': (eventInput * jobCost['Монтаж натяжного потолка']),
                'Монтаж точек': (eventInput * jobCost['Монтаж точек']),
            },
            'Работы с полом': {
                'Грунтование': (eventInput * jobCost['Грунтование']),
                'Наливной пол': (eventInput * jobCost['Наливной пол'])
            }
        }, {
            'материалЦена': {
                'Штукатурка': ((eventInput * 2.5) * (materialsCost['Штукатурка'])),
                'Наливной пол': ((eventInput) * (materialsCost['Наливной пол'])),
                'Медь': (materialsCost['Медь']),
                'Мешки под мусор': (materialsWaste['Мешки под мусор']) * (materialsCost['Мешки под мусор']),
                'Грунтовка': ((eventInput * 2.5) * materialsCost['Грунтовка']) * 2
            },
        }, {
            'материалРасход': {
                'Штукатурка': Math.round((eventInput * 2.5) * (materialsWaste['Штукатурка'])),
                'Наливной пол': Math.round((eventInput) * (materialsWaste['Наливной пол'])),
                'Медь': materialsWaste['Медь'],
                'Мешки под мусор': materialsWaste['Мешки под мусор'],
                'Грунтовка': ((eventInput * 2.5) * (materialsWaste['Грунтовка'])) * 2
            },

        }],
        'kitchen': [{
            'Демонтажные работы': {
                'Демонтаж штукатурки': ((eventInput * 2.5) * jobCost['Демонтаж штукатурки']),
                'Демонтаж напольного покрытия': (eventInput * jobCost['Демонтаж напольного покрытия']),
                'Затаривание в мешки': jobCost['Затаривание в мешки'],
                'Вынос мусора': jobCost['Вынос мусора'],
                'Вывоз мусора': jobCost['Вывоз мусора']
            },
            'Электротехнические работы': {
                'Прокладка штробы': ((eventInput / 2) * jobCost['Прокладка штробы']),
                'Прокладка кабеля': (eventInput * jobCost['Прокладка кабеля']),
                'Монтаж разпредкоробок': (2 * jobCost['Монтаж разпредкоробок']),
                'Отверстие под розетку': (6 * jobCost['Отверстие под розетку']),
            },
            'Штукатурные работы': {
                'Грунтование': ((eventInput * 2.5) * jobCost['Грунтование']),
                'Штукатурка стен': ((eventInput * 2.5) * jobCost['Штукатурка стен']),
                'Шпатлевка стен': ((eventInput * 2.5) * jobCost['Шпатлевка стен'])
            },
            'Монтаж натяжного потолка': {
                'Монтаж натяжного потолка': (eventInput * jobCost['Монтаж натяжного потолка']),
                'Монтаж точек': (eventInput * jobCost['Монтаж точек']),
                'Монтаж закладной': (jobCost['Монтаж закладной'])
            },
            'Работы с полом': {
                'Грунтование': (eventInput * jobCost['Грунтование']),
                'Наливной пол': (eventInput * jobCost['Наливной пол'])
            }
        }, {
            'материалЦена': {
                'Шпатлевка': ((eventInput * 2.5) * (materialsCost['Шпатлевка'])),
                'Штукатурка': ((eventInput * 2.5) * (materialsCost['Штукатурка'])),
                'Наливной пол': ((eventInput) * (materialsCost['Наливной пол'])),
                'Мешки под мусор': (materialsWaste['Мешки под мусор']) * (materialsCost['Мешки под мусор']),
                'Грунтовка': ((eventInput * 2.5) * materialsCost['Грунтовка']) * 2
            },
        }, {
            'материалРасход': {
                'Шпатлевка': ((eventInput * 2.5) * (materialsWaste['Шпатлевка'])),
                'Штукатурка': Math.round((eventInput * 2.5) * (materialsWaste['Штукатурка'])),
                'Наливной пол': Math.round((eventInput) * (materialsWaste['Наливной пол'])),
                'Мешки под мусор': materialsWaste['Мешки под мусор'],
                'Грунтовка': ((eventInput * 2.5) * (materialsWaste['Грунтовка'])) * 2
            },

        }]
    }
    return nameObjects[nameApartment]
}
